apache/nuttx/arch/risc-v/src/bl602/bl602_os_hal.c
/****************************************************************************
 * arch/risc-v/src/bl602/bl602_os_hal.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <bl602_os_hal.h>

#ifdef CONFIG_BL602_WIRELESS

#include <bl_os_adapter/bl_os_adapter.h>
#include <bl_os_adapter/bl_os_log.h>

#endif

#include <nuttx/debug.h>
#include <assert.h>
#include <errno.h>
#include <fcntl.h>
#include <ctype.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <pthread.h>

#include <sys/time.h>
#include <timer/timer.h>
#include <clock/clock.h>
#include <syslog.h>

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/kthread.h>
#include <nuttx/mqueue.h>
#include <nuttx/kmalloc.h>
#include <nuttx/pthread.h>
#include <nuttx/wqueue.h>
#include <nuttx/signal.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>

#include <bl602_netdev.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define OS_HPWORK HPWORK
#define OS_LPWORK LPWORK

#ifdef CONFIG_BL602_WIRELESS

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct mq_adpt
{
  struct file mq;           /* Message queue handle */
  uint32_t    msgsize;      /* Message size */
  char        name[16];     /* Message queue name */
};

struct irq_adpt
{
  void (*func)(void *arg);  /* Interrupt callback function */
  void *arg;                /* Interrupt private data */
};

enum bl_os_timer_mode
{
  BL_OS_TIEMR_ONCE = 0,
  BL_OS_TIEMR_CYCLE
};

typedef enum bl_os_timer_mode bl_os_timer_mode_t;

struct timer_adpt
{
  struct wdog_s wdog;
  int32_t delay;
  bl_os_timer_mode_t mode;
  void (*func)(void *arg);
  void *arg;
};

/****************************************************************************
 * Public Data
 ****************************************************************************/

extern void *__attribute__((weak)) _wifi_log_flag;

bl_ops_funcs_t g_bl_ops_funcs =
{
  ._version = BL_OS_ADAPTER_VERSION,
  ._printf = bl_os_printf,
  ._assert = bl_os_assert_func,
  ._init = bl_os_api_init,
  ._enter_critical = bl_os_enter_critical,
  ._exit_critical = bl_os_exit_critical,
  ._msleep = bl_os_msleep,
  ._sleep = bl_os_sleep,
  ._event_group_create = bl_os_event_create,
  ._event_group_delete = bl_os_event_delete,
  ._event_group_send = bl_os_event_send,
  ._event_group_wait = bl_os_event_wait,
  ._event_register = bl_os_event_register,
  ._event_notify = bl_os_event_notify,
  ._task_create = bl_os_task_create,
  ._task_delete = bl_os_task_delete,
  ._task_get_current_task = bl_os_task_get_current_task,
  ._task_notify_create = bl_os_task_notify_create,
  ._task_notify = bl_os_task_notify,
  ._task_wait = bl_os_task_wait,
  ._lock_gaint = bl_os_lock_gaint,
  ._unlock_gaint = bl_os_unlock_gaint,
  ._irq_attach = bl_os_irq_attach,
  ._irq_enable = bl_os_irq_enable,
  ._irq_disable = bl_os_irq_disable,
  ._workqueue_create = bl_os_workqueue_create,
  ._workqueue_submit_hp = bl_os_workqueue_submit_hpwork,
  ._workqueue_submit_lp = bl_os_workqueue_submit_lpwork,
  ._timer_create = bl_os_timer_create,
  ._timer_delete = bl_os_timer_delete,
  ._timer_start_once = bl_os_timer_start_once,
  ._timer_start_periodic = bl_os_timer_start_periodic,
  ._sem_create = bl_os_sem_create,
  ._sem_delete = bl_os_sem_delete,
  ._sem_take = bl_os_sem_take,
  ._sem_give = bl_os_sem_give,
  ._mutex_create = bl_os_mutex_create,
  ._mutex_delete = bl_os_mutex_delete,
  ._mutex_lock = bl_os_mutex_lock,
  ._mutex_unlock = bl_os_mutex_unlock,
  ._queue_create = bl_os_mq_creat,
  ._queue_delete = bl_os_mq_delete,
  ._queue_send_wait = bl_os_mq_send_wait,
  ._queue_send = bl_os_mq_send,
  ._queue_recv = bl_os_mq_recv,
  ._malloc = bl_os_malloc,
  ._free = bl_os_free,
  ._zalloc = bl_os_zalloc,
  ._get_time_ms = bl_os_clock_gettime_ms,
  ._get_tick = bl_os_get_tick,
  ._log_write = bl_os_log_write
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bl_os_assert_func
 *
 * Description:
 *   Delete timer and free resource
 *
 * Input Parameters:
 *   file  - assert file
 *   line  - assert line
 *   func  - assert function
 *   expr  - assert condition
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void bl_os_assert_func(const char *file, int line,
                       const char *func, const char *expr)
{
  printf("Assert failed in %s, %s:%d (%s)",
         func, file, line, expr);
  abort();
}

/****************************************************************************
 * Name: bl_os_event_create
 *
 * Description:
 *   Create event group
 *
 * Input Parameters:
 *
 * Returned Value:
 *   Event group data pointer
 *
 ****************************************************************************/

void *bl_os_event_create(void)
{
  return (void *)0;
}

/****************************************************************************
 * Name: bl_os_event_delete
 *
 * Description:
 *   Delete event and free resource
 *
 * Input Parameters:
 *   event  - event data point
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

void bl_os_event_delete(void *event)
{
}

/****************************************************************************
 * Name: bl_os_event_send
 *
 * Description:
 *   Set event bits
 *
 * Input Parameters:
 *
 * Returned Value:
 *   Event value after setting
 *
 ****************************************************************************/

uint32_t bl_os_event_send(void *event, uint32_t bits)
{
  return 0;
}

/****************************************************************************
 * Name: bl_os_event_wait
 *
 * Description:
 *   Delete timer and free resource
 *
 * Input Parameters:
 *   event
 *   bits_to_wait_for
 *   clear_on_exit
 *   wait_for_all_bits
 *   block_time_tick
 *
 * Returned Value:
 *   Current event value
 *
 ****************************************************************************/

uint32_t bl_os_event_wait(void *event,
                          uint32_t bits_to_wait_for,
                          int clear_on_exit,
                          int wait_for_all_bits,
                          uint32_t block_time_tick)
{
  return 0;
}

/****************************************************************************
 * Name: bl_os_event_register
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_event_register(int type, void *cb, void *arg)
{
  return 0;
}

/****************************************************************************
 * Name: bl_os_event_notify
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_event_notify(int evt, int val)
{
  bl602_net_event(evt, val);
  return 0;
}

/****************************************************************************
 * Name: bl_os_task_create
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

