apache/nuttx/arch/risc-v/src/bl602/bl602_os_hal.c
  memset((void *)timer, 0, sizeof(struct timer_adpt));

  timer->func = func;
  timer->arg = argv;

  return timer;
}

/****************************************************************************
 * Name: bl_os_timer_delete
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_timer_delete(void *timerid, uint32_t tick)
{
  struct timer_adpt *timer;
  int ret;

  timer = (struct timer_adpt *)timerid;

  if (!timer)
    {
      return -EFAULT;
    }

  ret = wd_cancel(&timer->wdog);

  kmm_free(timerid);

  return ret;
}

/****************************************************************************
 * Name: os_timer_start_once
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_timer_start_once(void *timerid, long t_sec, long t_nsec)
{
  struct timer_adpt *timer;
  struct timespec reltime;

  timer = (struct timer_adpt *)timerid;

  if (!timer)
    {
      return -EFAULT;
    }

  reltime.tv_nsec = t_nsec;
  reltime.tv_sec = t_sec;

  timer->mode = BL_OS_TIEMR_ONCE;
  timer->delay = clock_time2ticks(&reltime);

  return wd_start(&timer->wdog,
                  timer->delay,
                  bl_os_timer_callback,
                  (wdparm_t)timer);
}

/****************************************************************************
 * Name: os_timer_start_periodic
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_timer_start_periodic(void *timerid, long t_sec, long t_nsec)
{
  struct timer_adpt *timer;
  struct timespec reltime;

  timer = (struct timer_adpt *)timerid;

  if (!timer)
    {
      return -EFAULT;
    }

  reltime.tv_nsec = t_nsec;
  reltime.tv_sec = t_sec;

  timer->mode = BL_OS_TIEMR_CYCLE;
  timer->delay = clock_time2ticks(&reltime);

  return wd_start(&timer->wdog,
                  timer->delay,
                  bl_os_timer_callback,
                  (wdparm_t)timer);
}

/****************************************************************************
 * Name: bl_os_workqueue_create
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

void *bl_os_workqueue_create(void)
{
  struct work_s *work = kmm_calloc(1, sizeof(struct work_s));
  if (!work)
    {
      ASSERT(0);
    }

  return (void *)work;
}

/****************************************************************************
 * Name: bl_os_workqueue_submit_hpwork
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_workqueue_submit_hpwork(void *work,
                                  void *worker,
                                  void *argv,
                                  long tick)
{
  if (!work)
    {
      return -EINVAL;
    }

  if (!work_available((struct work_s *)work))
    {
      return -EINVAL;
    }

  return work_queue(OS_HPWORK, work, worker, argv, tick);
}

/****************************************************************************
 * Name: bl_os_workqueue_submit_lpwork
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

int bl_os_workqueue_submit_lpwork(void *work,
                                  void *worker,
                                  void *argv,
                                  long tick)
{
  if (!work)
    {
      return -EINVAL;
    }

  if (!work_available((struct work_s *)work))
    {
      return -EINVAL;
    }

  return work_queue(OS_LPWORK, work, worker, argv, tick);
}

/****************************************************************************
 * Name: bl_os_clock_gettime_ms
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

uint64_t bl_os_clock_gettime_ms(void)
{
  struct timespec ts;
  clock_systime_timespec(&ts);
  return ts.tv_sec * 1000 + ts.tv_nsec / 1000000;
}

/****************************************************************************
 * Name: bl_os_get_tick
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

uint32_t bl_os_get_tick()
{
  uint32_t tick;

  tick = bl_os_clock_gettime_ms();

  return tick;
}

/****************************************************************************
 * Name: bl_os_isr_adpt_cb
 *
 * Description:
 *   Wi-Fi interrupt adapter callback function
 *
 * Input Parameters:
 *   arg - interrupt adapter private data
 *
 * Returned Value:
 *   0 on success
 *
 ****************************************************************************/

static int bl_os_isr_adpt_cb(int irq, void *context, void *arg)
{
  struct irq_adpt *adapter = (struct irq_adpt *)arg;

  adapter->func(adapter->arg);

  return 0;
}

/****************************************************************************
 * Name: bl_os_irq_attach
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

void bl_os_irq_attach(int32_t n, void *f, void *arg)
{
  int ret;
  struct irq_adpt *adapter;

  wlinfo("INFO: n=%ld f=%p arg=%p\n", n, f, arg);

  adapter = kmm_malloc(sizeof(struct irq_adpt));

  if (!adapter)
    {
      DEBUGPANIC();
    }

  adapter->func = f;
  adapter->arg  = arg;

  ret = irq_attach(n, bl_os_isr_adpt_cb, (void *)adapter);

  if (ret != OK)
    {
      DEBUGPANIC();
    }
}

/****************************************************************************
 * Name: bl_os_irq_enable
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

void bl_os_irq_enable(int32_t n)
{
  up_enable_irq(n);
}

/****************************************************************************
 * Name: bl_os_irq_disable
 *
 * Description:
 *
 * Input Parameters:
 *
 * Returned Value:
 *
 ****************************************************************************/

void bl_os_irq_disable(int32_t n)
{
  up_disable_irq(n);
}

/****************************************************************************
 * Name: bl_os_mutex_create
 *
 * Description:
 *   Create mutex
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Mutex data pointer
 *
 ****************************************************************************/

void *bl_os_mutex_create(void)
{
  mutex_t *mutex;
  int tmp;

  tmp = sizeof(mutex_t);
  mutex = kmm_malloc(tmp);
  if (!mutex)
    {
      wlerr("ERROR: Failed to alloc %d memory\n", tmp);
      return NULL;
    }

